{
  "main": {
    "name":"Victor Yap",
    "occupation":"Based in Singapore, learning to be a full Stack developer",
    "description":"I enjoy creating websites and moblie apps. I am also comfortable with backend database such as SQL Server",
    "image":"profilepic.jpg",
    "bio":"I was first introduced to web and mobile development by a friend in 2015 and I became fascinated by the potential of technology. Soon after, I decided to delve head-first into web development by attending NUS ISS’s course where the instructors and community helped me cultivate a strong foundation and supplement my knowledge.",
    "email": "victoryapcheeann@gmail.com",
    "phone": "90025405",
    "address":{
      "street":"Marsiling Drive",
      "city":"Singapore"
    },
    "resumedownload":"https://drive.google.com/open?id=1ujzk32d4OoxRpOaqF_QpPFthKYe2hKfb5_AXPLR8mgc",
    "social":[
      {
        "name":"facebook",
        "url":"https://www.facebook.com/chee.ann.14",
        "className":"fa fa-facebook"
      },
      {
        "name":"github",
        "url":"https://github.com/victoryapcheeann",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "education":[
      {
        "school":"National University of Singapore",
        "degree":"Post-Graduate Diploma in System Analysis (SA42)",
        "graduated":"2016 - Present",
        "description":"The Graduate Diploma in Systems Analysis programme (GDipSA) is designed for non-IT graduates intending to craft a new career path in the IT industry."
      },
      {
        "school":"University at Buffalo",
        "degree":"B.A. Degree in Business Administration",
        "graduated":"2012 - 2015",
        "description":"Major: Business Administration, Concentration: Financial Analysis"
      }
    ],
    "work":[
      {
        "company":"Island Peak Tech",
        "title":"Software Developer Internship",
        "years":"Oct 2016 - Mar 2017",
        "description":"InHi Travel is a mobile app that provides customers with latest and accurate travel information about Singapore. My primary job responsibility is to develop the back-end to support the iOS app.",
        "workdetail1":"Help user to save time by plotting the shortest route for the list of destination they are going using Google API",
        "workdetail2":"After user searched for the attraction, they can easily purchase the ticket for the attraction via the app. The tickets are obtained from a 3rd party API known as GlobalTix.",
        "workdetail3":"Upon buying the ticket they can easily make their payment via WePay, a popular payment platform in China"
      }
    ],
    "projects":[
      {
        "name":"Victor Resume",
        "date":"Feb 2017",
        "description":"Designed and developed my resume on the website using ReactJS, HTML and CSS.",
        "function":"Find out more about me on my website!"
      },
      {
        "name":"React Weather Web",
        "date":"Feb 2017",
        "description":"Designed and developed a weather application using ReactJS and OpenWeatherMap API",
        "function":"Enable to users to search for temperature of a location."
      },
      {
        "name":"iOS App",
        "date":"Jul 2016",
        "description":"Designed and developed a Flickr application using XCode and SQLite",
        "function":"Enable to users to search for Flickr photos on the application, Save the photos in a favorite list along with the comments, Update or delete the photos/comments in the favorite list"
      },
      {
        "name":"Android App",
        "date":"Jun 2016",
        "description":"Designed and developed a tour agency management system using Android Studio and WCF",
        "function":"Managing tourist information, Display tour route on Google Map using Google Map API"
      },
      {
        "name":"Club Application Booking System",
        "date":"May 2016",
        "description":"Designed and developed a club application booking system using Spring MVC and MySQL",
        "function":"Booking of facilities, Maintenance of members, admin and booking information"
      },
      {
        "name":"Library Management System",
        "date":"Mar 2016",
        "description":"Designed and developed a book management system using Visual C# and SQL Server 2012",
        "function":"Maintenance of member and book information, Creation of reports, Support business transactions (Borrowing and lending)"
      }
    ],
    "skills":[
      {"name":"C#"},
      {"name":"Java"},
      {"name":"HTML"},
      {"name":"CSS"},
      {"name":"SQL Server"},
      {"name":"ReactJS (Currently learning)"},
      {"name":"React Native (Currently learning)"}
    ],
    "interests":[
      {"name":"Mobile Development"},
      {"name":"Web Development"},
      {"name":"VR AR Game Development"},
      {"name":"IOT - Arduino"}
    ],
    "futureprojects":[
      {"name":"Spotify (Web)"},
      {"name":"Unity & Unreal Game Engine Projects"},
      {"name":"Data Visualization(Using D3.js)"}
    ],
    "others":[
      {
        "title":"Leadership, NUS-ISS Class Representative (SA42)",
        "description":"Act as a liaison between the students and the lecturers. Ensure that my classmates are properly represented and completely informed.",
        "othersdetail1":"Informing my classmate(China, India, Myanmar..) the latest update and news",
        "othersdetail2":"Organize & host a game section for SA42 and SA43, allow the juniors and senior to know more about each other.",
        "othersdetail3":"Organize & host a BBQ session for SA42, allow students from SA42 to discuss learn about their internship experiences."
      }
    ]
  }
}
